Белгипрозем_2017/src/Catalogs/мКолонкиТаблиц/мКолонкиТаблиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мКолонкиТаблиц</name>
  <owners>Catalog.мТаблицыНормВремени</owners>
  <attributes>
    <name>НомерКолонки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчета</name>
    <type>
      <types>EnumRef.ВариантыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляПоследующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийЭлемент</name>
    <type>
      <types>CatalogRef.мКолонкиТаблиц</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Enums/ВариантыРасчетов/ВариантыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРасчетов</name>
  <enumValues>
    <name>Интервал</name>
  </enumValues>
  <enumValues>
    <name>КаждыеПоследующие</name>
  </enumValues>
  <enumValues>
    <name>Сверх</name>
  </enumValues>
  <enumValues>
    <name>КаждыеПоследующиеВИнтервале</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/мКолонкиТаблиц/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Объект.ВариантРасчета = Перечисления.ВариантыРасчетов.КаждыеПоследующие Тогда
        Элементы.ПредыдущийЭлемент.Видимость = Истина;
        Элементы.ДляПоследующих.Видимость = Истина;
    Иначе
        Элементы.ПредыдущийЭлемент.Видимость = Ложь;
        Элементы.ДляПоследующих.Видимость = Ложь;
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаименование()
	Объект.Наименование = "";
	Если Объект.НижняяГраницаДиапазона > 0 Тогда
        Если Объект.ВерхняяГраницаДиапазона = 0 Тогда
            Если Объект.ВариантРасчета = ПредопределенноеЗначение("Перечисление.ВариантыРасчетов.КаждыеПоследующие") Тогда
                Объект.Наименование = Объект.Наименование + "На кажд. посл. "+Объект.ДляПоследующих;
            Иначе	
                Объект.Наименование = Объект.Наименование + "Сверх "+Объект.НижняяГраницаДиапазона;
            КонецЕсли; 
		Иначе
			Объект.Наименование = Объект.Наименование + "От "+Объект.НижняяГраницаДиапазона + " до "+Объект.ВерхняяГраницаДиапазона;
		КонецЕсли;
	Иначе	
		Если Объект.ВерхняяГраницаДиапазона > 0 Тогда	
			Объект.Наименование = "До "+Объект.ВерхняяГраницаДиапазона;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура НижняяГраницаДиапазонаПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВерхняяГраницаДиапазонаПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВариантРасчетаПриИзменении(Элемент)
	СоздатьНаименование();
    
    Элементы.ПредыдущийЭлемент.Видимость = ПоказатьПредыдущийЭлемент(Объект.ВариантРасчета);
    Элементы.ДляПоследующих.Видимость = ПоказатьПредыдущийЭлемент(Объект.ВариантРасчета);
КонецПроцедуры

&НаКлиенте
Процедура ДляПоследующихПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказатьПредыдущийЭлемент(ВариантРасчета)
    Возврат ВариантРасчета = Перечисления.ВариантыРасчетов.КаждыеПоследующие;
КонецФункции // ПоказатьПредыдущийЭлемент()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    Оповестить("Записана колонка таблицы", , Объект.Ссылка);
КонецПроцедуры
